IDENTIFICATION DIVISION.
PROGRAM-ID. CHALLENGE.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT CHALLENGE_INPUT ASSIGN TO 'input'
      ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
   FILE SECTION.
   FD CHALLENGE_INPUT.
   01 CHALLENGE-FILE.
      05 CALORIES PIC 9(10).

   WORKING-STORAGE SECTION.
   01 WS-CALORIES.
      05 WS-CALORIES-ID PIC 9(10).
   01 WS-EOF PIC A(1).
   01 TOTAL_CALORIES PIC 9(10) VALUE 0.
   01 HIGHEST_CALORIES PIC 9(10) VALUE 0.
   01 CALORIES_EDIT PIC 9(10).

PROCEDURE DIVISION.
   OPEN INPUT CHALLENGE_INPUT.
      PERFORM UNTIL WS-EOF='Y'
         READ CHALLENGE_INPUT INTO WS-CALORIES
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END
            IF CALORIES EQUAL '' THEN
              IF TOTAL_CALORIES > HIGHEST_CALORIES
                MOVE TOTAL_CALORIES TO HIGHEST_CALORIES
              END-IF

              MOVE ZERO TO TOTAL_CALORIES
            ELSE
              MOVE CALORIES TO CALORIES_EDIT
              COMPUTE TOTAL_CALORIES = FUNCTION NUMVAL-C(CALORIES_EDIT) + TOTAL_CALORIES
            END-IF
         END-READ
      END-PERFORM.
   DISPLAY HIGHEST_CALORIES
   CLOSE CHALLENGE_INPUT.
STOP RUN.
